In [43]:
import numpy as np
import pandas as pd

In [44]:
from numpy.random import randn

In [45]:
np.random.seed(101)

In [46]:
df = pd.DataFrame(randn(5,4),['A','B','C','D','E'],['X','Y','W','Z'])

In [47]:
df

          X         Y         W         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [48]:
df['W']

A    0.907969
B   -0.848077
C    0.528813
D   -0.933237
E    2.605967
Name: W, dtype: float64

In [49]:
df.W

A    0.907969
B   -0.848077
C    0.528813
D   -0.933237
E    2.605967
Name: W, dtype: float64

In [50]:
type(df['W'])

pandas.core.series.Series

In [51]:
type(df)

pandas.core.frame.DataFrame

In [52]:
df[['X','Y']]

          X         Y
A  2.706850  0.628133
B  0.651118 -0.319318
C -2.018168  0.740122
D  0.188695 -0.758872
E  0.190794  1.978757

In [53]:
df['new'] = df['W']+ df['X']

In [54]:
df

          X         Y         W         Z       new
A  2.706850  0.628133  0.907969  0.503826  3.614819
B  0.651118 -0.319318 -0.848077  0.605965 -0.196959
C -2.018168  0.740122  0.528813 -0.589001 -1.489355
D  0.188695 -0.758872 -0.933237  0.955057 -0.744542
E  0.190794  1.978757  2.605967  0.683509  2.796762

In [55]:
df.drop('new',axis=1,inplace=True)

In [56]:
df

          X         Y         W         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [57]:
df.drop('E')

          X         Y         W         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057

In [58]:
df

          X         Y         W         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [59]:
df.shape

(5, 4)

In [60]:
df.loc['C']

X   -2.018168
Y    0.740122
W    0.528813
Z   -0.589001
Name: C, dtype: float64

In [61]:
df.iloc[2]

X   -2.018168
Y    0.740122
W    0.528813
Z   -0.589001
Name: C, dtype: float64

In [62]:
df

          X         Y         W         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [63]:
booldf = df > 0

In [64]:
booldf

       X      Y      W      Z
A   True   True   True   True
B   True  False  False   True
C  False   True   True  False
D   True  False  False   True
E   True   True   True   True

In [65]:
df[booldf]

          X         Y         W         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118       NaN       NaN  0.605965
C       NaN  0.740122  0.528813       NaN
D  0.188695       NaN       NaN  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [66]:
df[df>0]

          X         Y         W         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118       NaN       NaN  0.605965
C       NaN  0.740122  0.528813       NaN
D  0.188695       NaN       NaN  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [67]:
df

          X         Y         W         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [68]:
df[df['Z']<0]

          X         Y         W         Z
C -2.018168  0.740122  0.528813 -0.589001

In [69]:
resdf = df[df['W']>0]

In [70]:
resdf['X']

A    2.706850
C   -2.018168
E    0.190794
Name: X, dtype: float64

In [71]:
boolser = df['W']>0

In [72]:
result = df[boolser]

In [73]:
result

          X         Y         W         Z
A  2.706850  0.628133  0.907969  0.503826
C -2.018168  0.740122  0.528813 -0.589001
E  0.190794  1.978757  2.605967  0.683509

In [74]:
df[df['Z']<0]

          X         Y         W         Z
C -2.018168  0.740122  0.528813 -0.589001

In [75]:
df[df['X']>0][['Y','W']]

          Y         W
A  0.628133  0.907969
B -0.319318 -0.848077
D -0.758872 -0.933237
E  1.978757  2.605967

In [76]:
boolser = df['X']>0
res = df[boolser]
col = ['Y','W']
res[col]

          Y         W
A  0.628133  0.907969
B -0.319318 -0.848077
D -0.758872 -0.933237
E  1.978757  2.605967

In [81]:
df[(df['W']<0.7) & (df['Y']>0.5) ]

          X         Y         W         Z
C -2.018168  0.740122  0.528813 -0.589001

In [82]:
df.reset_index()

  index         X         Y         W         Z
0     A  2.706850  0.628133  0.907969  0.503826
1     B  0.651118 -0.319318 -0.848077  0.605965
2     C -2.018168  0.740122  0.528813 -0.589001
3     D  0.188695 -0.758872 -0.933237  0.955057
4     E  0.190794  1.978757  2.605967  0.683509

In [85]:
newid = 'IND NEP US UK PAK'.split()

In [86]:
newid

['IND', 'NEP', 'US', 'UK', 'PAK']

In [87]:
df['Country'] = newid

In [88]:
df

          X         Y         W         Z Country
A  2.706850  0.628133  0.907969  0.503826     IND
B  0.651118 -0.319318 -0.848077  0.605965     NEP
C -2.018168  0.740122  0.528813 -0.589001      US
D  0.188695 -0.758872 -0.933237  0.955057      UK
E  0.190794  1.978757  2.605967  0.683509     PAK

In [89]:
 df.set_index('Country')

                X         Y         W         Z
Country
IND      2.706850  0.628133  0.907969  0.503826
NEP      0.651118 -0.319318 -0.848077  0.605965
US      -2.018168  0.740122  0.528813 -0.589001
UK       0.188695 -0.758872 -0.933237  0.955057
PAK      0.190794  1.978757  2.605967  0.683509

In [90]:
df

          X         Y         W         Z Country
A  2.706850  0.628133  0.907969  0.503826     IND
B  0.651118 -0.319318 -0.848077  0.605965     NEP
C -2.018168  0.740122  0.528813 -0.589001      US
D  0.188695 -0.758872 -0.933237  0.955057      UK
E  0.190794  1.978757  2.605967  0.683509     PAK

In [ ]:
#Multi-index dataframe

In [92]:
outside = 'G1 G1 G1 G2 G2 G2'.split()
inside = [1,2,3,1,2,3]
hier_index = list(zip(outside,inside))
hier_index = pd.MultiIndex.from_tuples(hier_index)

In [93]:
hier_index

MultiIndex([('G1', 1),
            ('G1', 2),
            ('G1', 3),
            ('G2', 1),
            ('G2', 2),
            ('G2', 3)],
           )

In [94]:
df = pd.DataFrame(randn(6,2),hier_index,['A','B'])

In [95]:
df

             A         B
G1 1  0.302665  1.693723
   2 -1.706086 -1.159119
   3 -0.134841  0.390528
G2 1  0.166905  0.184502
   2  0.807706  0.072960
   3  0.638787  0.329646

In [96]:
df.loc['G1']

          A         B
1  0.302665  1.693723
2 -1.706086 -1.159119
3 -0.134841  0.390528

In [97]:
df['A']

G1  1    0.302665
    2   -1.706086
    3   -0.134841
G2  1    0.166905
    2    0.807706
    3    0.638787
Name: A, dtype: float64

In [106]:
df.loc['G1'].iloc[1]

A   -1.706086
B   -1.159119
Name: 2, dtype: float64

In [101]:
df.index.names = ['Groups','Num']

In [102]:
df

                   A         B
Groups Num
G1     1    0.302665  1.693723
       2   -1.706086 -1.159119
       3   -0.134841  0.390528
G2     1    0.166905  0.184502
       2    0.807706  0.072960
       3    0.638787  0.329646

In [105]:
df.loc['G1'].loc[2]['B']

-1.1591194155484297

In [107]:
df.xs('G1')

            A         B
Num
1    0.302665  1.693723
2   -1.706086 -1.159119
3   -0.134841  0.390528

In [108]:
df.xs(1,level='Num')

               A         B
Groups
G1      0.302665  1.693723
G2      0.166905  0.184502